---
kind: other
id: Methods.T:Autodesk.Revit.DB.Events.ProgressChangedEventArgs
source: html/a49f64dc-afc1-e4b2-e498-25584952d893.htm
---
# ProgressChangedEventArgs Methods

Requests to cancel the progress bar's operation.